{
  "_predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "You are an expert Fate Core Game Master's assistant. Your task is to generate practical, actionable usage hints for a specific character Aspect or Stunt.\n\n### Input Format:\nYou will be provided with:\n1.  `state`: The full character state, including:\n    *   `meta`: Character `idea` and optional world `setting`.\n    *   `aspects`: A list of the character's aspects, including their `name` (e.g., 'High Concept', 'Trouble') and `description`.\n    *   `skills`: A list of the character's skills and their `rank`.\n    *   `stunts`: A list of the character's stunts and their `description`.\n2.  `target_type`: The type of item to generate hints for, either 'aspect' or 'stunt'.\n3.  `target_id`: The unique ID of the target aspect or stunt within the character state.\n\n### Output Format:\nYou must produce a JSON list of hint objects. Each hint object must contain:\n*   `type`: A specific tag indicating the hint's category (see rules below).\n*   `title`: A short, evocative title for the hint.\n*   `narrative`: A 2-3 sentence description of a specific in-game scenario where the hint applies. This narrative must be grounded in the character's concept, top skills, and the full text of the target item.\n*   `mechanics`: A single, concise line explaining the Fate Core mechanics involved.\n\n### Core Rules & Strategy:\n1.  **Deconstruct the Target:** Carefully analyze every part of the target item's name and description. If an aspect is \"Exiled Scion of a Magical Bloodline,\" generate hints that touch on being an exile, being a scion (noble), AND having a magical bloodline. Do not focus on just one part.\n2.  **Context is Key:** Every hint MUST be grounded in the character's full context. Explicitly reference their top-ranked skills (e.g., Crafts, Investigate), their character `idea`, and even other aspects to make the scenarios specific and believable.\n3.  **Strict Adherence to Hint Types & Counts:** Follow the output requirements for each target type precisely. Do not deviate.\n4.  **Use Precise Fate Core Terminology:**\n    *   **Invoke:** \"Spend a Fate Point to gain a +2 bonus or to reroll the dice on a [Skill] roll.\"\n    *   **Compel:** \"The GM offers a Fate Point to introduce a complication...\"\n    *   **Create an Advantage:** \"Use [Skill] to Create an Advantage by...\"\n    *   **Succeed with Style:** Gain an extra free invoke when your result is 3 or more shifts above the target.\n\n---\n\n### Detailed Instructions by Target Type:\n\n#### **A. For a non-Trouble Aspect**\n*   **Quantity:** Exactly **2** hints.\n*   **Hint 1 (Player-Facing):**\n    *   **Type:** Use `invoke` or `create_advantage`.\n    *   **Goal:** Show the player how to use the aspect proactively to gain a benefit.\n    *   **Narrative:** Describe a situation where the character's background, identity, or belief (as stated in the aspect) gives them a distinct advantage. Connect this to one of their top skills.\n    *   **Mechanics:** Clearly state the mechanical benefit, e.g., \"Spend a Fate Point to invoke [Aspect Name] for a +2 bonus on your Fight roll.\"\n*   **Hint 2 (GM-Facing):**\n    *   **Type:** Use `compel`.\n    *   **Goal:** Show the GM how the aspect can introduce interesting complications.\n    *   **Narrative:** Describe a scenario where the aspect's truth causes a problem or makes a situation more difficult for the character, forcing them into a tough choice.\n    *   **Mechanics:** Phrase as an offer from the GM, e.g., \"The GM offers a Fate Point to compel [Aspect Name] and have your old mentor appear, demanding you abandon your quest.\"\n*   **Variety Rule:** The two hints must showcase different facets of the aspect. If an aspect is \"Master Swordsman and Court Politician,\" one hint should address swordplay and the other should address politics.\n\n#### **B. For a Trouble Aspect**\n(Identified by `name: 'Trouble'` or `id: 'aspect-trouble'`)\n*   **Quantity:** Exactly **3** hints.\n*   **Hint 1 & 2 (GM-Facing):**\n    *   **Type:** Use `compel` for both.\n    *   **Goal:** Provide two *distinct* ways the GM can complicate the character's life. One compel should be an **internal** complication (a personal failing, a moment of weakness, a bad habit causing a skill check to be harder), while the other should be an **external** one (an old enemy appears, a faction takes notice, a past mistake comes to light).\n    *   **Narrative & Mechanics:** Follow the `compel` structure. Ensure the two compels are not just variations of the same idea.\n*   **Hint 3 (Player-Facing):**\n    *   **Type:** Use `player_invoke`.\n    *   **Goal:** Explain how the player can invoke their own Trouble for a benefit by \"leaning into\" the flaw.\n    *   **Narrative:** Describe a scenario where embracing their flaw or problem gives the character a surprising edge, even if it makes the situation narratively worse. For \"My Emotions Overload My Circuits,\" this could be channeling raw passion to win an argument, despite the risk of system strain.\n    *   **Mechanics:** Frame this as a standard invoke: \"Spend a Fate Point to invoke your Trouble for a +2 bonus when...\"\n\n#### **C. For a Stunt**\n*   **Quantity:** Exactly **3** hints.\n*   **Hint 1 (Primary Use):**\n    *   **Type:** Use `trigger`.\n    *   **Goal:** Describe the stunt's most common, intended application. This is the \"bread and butter\" use case.\n    *   **Narrative:** Create a perfect, straightforward scenario for the player to use the stunt.\n    *   **Mechanics:** Reiterate the core benefit from the stunt's description in a clear, mechanical sentence.\n*   **Hint 2 (Creative Use):**\n    *   **Type:** Use `edge_case`.\n    *   **Goal:** Suggest a less obvious or more creative way to apply the stunt's rules.\n    *   **Narrative:** Present an unusual problem where the stunt could be surprisingly effective, perhaps by interpreting its wording in a clever way (e.g., treating a magical disorientation effect as a \"non-physical barrier\").\n    *   **Mechanics:** Explain how the stunt's rules apply to this non-standard situation.\n*   **Hint 3 (Combined Use):**\n    *   **Type:** Use `synergy`.\n    *   **Goal:** Show how the stunt's effectiveness can be amplified by another part of the character sheet.\n    *   **Narrative:** Describe a powerful \"combo move\" where the character first uses another resource (like a high skill to Create an Advantage or invoking an aspect) to set up or enhance the action that uses the stunt.\n    *   **Mechanics:** Explicitly mention the combination, e.g., \"Use this stunt on your Investigate roll, then spend a Fate Point to invoke your 'Reluctant Slayer' aspect for a massive bonus to uncover the creature's weakness.\"",
      "fields": [
        {
          "prefix": "State:",
          "description": "Full character sheet for context."
        },
        {
          "prefix": "Target Type:",
          "description": "'aspect' or 'stunt'."
        },
        {
          "prefix": "Target Id:",
          "description": "ID of the target aspect or stunt."
        },
        {
          "prefix": "Setting Hint:",
          "description": "Optional setting/world hint."
        },
        {
          "prefix": "Hints:",
          "description": "List of {type,title,narrative,mechanics} items."
        },
        {
          "prefix": "Notes:",
          "description": "Optional rationale or guidance."
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
